{"_type":"export","__export_format":4,"__export_date":"2021-12-15T18:46:05.512Z","__export_source":"insomnia.desktop.app:v2021.5.3","resources":[{"_id":"req_da90a4e8f45e49eeb63b38a67d07774f","parentId":"fld_b2489db7e78841e0912e2a7f96c02399","modified":1639540973541,"created":1638400514995,"url":"{{ _.url }}/user/create","name":"create","description":"","method":"POST","body":{"mimeType":"application/json","text":"{\n\t\"name\": \"Isabella Nunes\",\n\t\"email\": \"isabellanunes@gmail.com\",\n\t\"birthdate\": \"15/06/1993\",\n\t\"imageUrl\": \"https://files.cercomp.ufg.br/weby/up/183/o/12193656_1516786235305635_5143297021428177416_n.jpg\",\n\t\"password\": \"12345678\",\n\t\"passwordConfirmation\": \"12345678\"\n}"},"parameters":[],"headers":[{"name":"Content-Type","value":"application/json","id":"pair_6533924cbf7648878575eea06a484712"}],"authentication":{},"metaSortKey":-1638400514996,"isPrivate":false,"settingStoreCookies":true,"settingSendCookies":true,"settingDisableRenderRequestBody":false,"settingEncodeUrl":true,"settingRebuildPath":true,"settingFollowRedirects":"global","_type":"request"},{"_id":"fld_b2489db7e78841e0912e2a7f96c02399","parentId":"wrk_c6293ab5a0024a5886bd474ca8829ace","modified":1639540226515,"created":1638400311887,"name":"User","description":"","environment":{},"environmentPropertyOrder":null,"metaSortKey":-1639011030438,"_type":"request_group"},{"_id":"wrk_c6293ab5a0024a5886bd474ca8829ace","parentId":null,"modified":1639173624951,"created":1638399970189,"name":"plants-api","description":"","scope":"collection","_type":"workspace"},{"_id":"req_fbec789e12c34e358e3c6329904451f7","parentId":"fld_b2489db7e78841e0912e2a7f96c02399","modified":1639539345296,"created":1638838576276,"url":"{{ _.url }}/user/update/","name":"update","description":"","method":"PATCH","body":{"mimeType":"application/json","text":"{\n\t\"email\": \"isabellanunes@gmail.com\",\n\t\"imageUrl\": \"https://files.cercomp.ufg.br/weby/up/183/o/12193656_1516786235305635_5143297021428177416_n.jpg\"\n}"},"parameters":[],"headers":[{"name":"Content-Type","value":"application/json","id":"pair_6533924cbf7648878575eea06a484712"},{"id":"pair_9bb5542ec11c4ea59fcff3849e8b4525","name":"Authorization","value":"{{ _.token }}","description":""}],"authentication":{},"metaSortKey":-1638400514983.5,"isPrivate":false,"settingStoreCookies":true,"settingSendCookies":true,"settingDisableRenderRequestBody":false,"settingEncodeUrl":true,"settingRebuildPath":true,"settingFollowRedirects":"global","_type":"request"},{"_id":"req_46492a16c7d4428b89a9d06716c42fb5","parentId":"fld_b2489db7e78841e0912e2a7f96c02399","modified":1639527791383,"created":1638842053802,"url":"{{ _.url }}/user/delete/","name":"delete","description":"","method":"DELETE","body":{"mimeType":"application/json","text":""},"parameters":[],"headers":[{"name":"Content-Type","value":"application/json","id":"pair_6533924cbf7648878575eea06a484712"},{"id":"pair_7db5e450d11d4e38a4699844a6000a7c","name":"Authorization","value":"{{ _.token }}","description":""}],"authentication":{},"metaSortKey":-1638400514980.375,"isPrivate":false,"settingStoreCookies":true,"settingSendCookies":true,"settingDisableRenderRequestBody":false,"settingEncodeUrl":true,"settingRebuildPath":true,"settingFollowRedirects":"global","_type":"request"},{"_id":"req_4dfd4555d38645849358009e1b8809d7","parentId":"fld_b2489db7e78841e0912e2a7f96c02399","modified":1639540826781,"created":1639178598477,"url":"{{ _.url }}/user/addList/","name":"addList","description":"","method":"PATCH","body":{"mimeType":"application/json","text":""},"parameters":[],"headers":[{"name":"Content-Type","value":"application/json","id":"pair_6533924cbf7648878575eea06a484712"},{"id":"pair_9bb5542ec11c4ea59fcff3849e8b4525","name":"Authorization","value":"{{ _.token }}","description":""}],"authentication":{},"metaSortKey":-1638400514977.25,"isPrivate":false,"settingStoreCookies":true,"settingSendCookies":true,"settingDisableRenderRequestBody":false,"settingEncodeUrl":true,"settingRebuildPath":true,"settingFollowRedirects":"global","_type":"request"},{"_id":"req_483c7a4845c94ea396fb15f0a8b3bb57","parentId":"fld_0808fe3a070a49c0b930260685d56178","modified":1639542520777,"created":1638406647761,"url":"{{ _.url }}/plant/create","name":"create","description":"","method":"POST","body":{"mimeType":"application/json","text":"{\n  \"scientificName\": \"Gomphrena globosa\",\n\t\"commonName\": \"Perpétua\",\n\t\"description\": \"A perpétua é originalmente uma planta herbácea de flores de coloração roxa. No entanto, hoje em dia já são produzidas variedades de diversas cores. Suas folhas são oval-lanceoladas, de textura pilosa e coloração verde-clara. Ela é versátil, tendo várias funções paisagísticas, podendo ser utilizada como forração ou para compor canteiros, bordaduras e maciços. Além disso, pode ser cultivada para a produção de flores secas.\",\n\t\"imageUrl\": \"https://www.jardineiro.net/wp-content/uploads/2011/05/gomphrena_globosa.jpg\"\n}"},"parameters":[],"headers":[{"name":"Content-Type","value":"application/json","id":"pair_6533924cbf7648878575eea06a484712"},{"id":"pair_846d0404d5a34ead895e982333334042","name":"Authorization","value":"{{ _.token }}","description":""}],"authentication":{},"metaSortKey":-1638400514946,"isPrivate":false,"settingStoreCookies":true,"settingSendCookies":true,"settingDisableRenderRequestBody":false,"settingEncodeUrl":true,"settingRebuildPath":true,"settingFollowRedirects":"global","_type":"request"},{"_id":"fld_0808fe3a070a49c0b930260685d56178","parentId":"wrk_c6293ab5a0024a5886bd474ca8829ace","modified":1639540229111,"created":1638406624395,"name":"Plant","description":"","environment":{},"environmentPropertyOrder":null,"metaSortKey":-1639011030413,"_type":"request_group"},{"_id":"req_da78e2a924bf4fed9d3ec3a6fc71be5a","parentId":"fld_0808fe3a070a49c0b930260685d56178","modified":1639593922473,"created":1639528787310,"url":"{{ _.url }}/plant/createMany","name":"createMany","description":"","method":"POST","body":{"mimeType":"application/json","text":"[\n  {\n    \"scientificName\": \"Malus Pumila\",\n    \"commonName\": \"Apple\",\n    \"description\": \"An apple is a sweet, edible fruit produced by an apple tree (Malus pumila). Apple trees are cultivated worldwide, and are the most widely grown species in the genus Malus. The tree originated in Central Asia, where its wild ancestor, Malus sieversii, is still found today. Apples have been grown for thousands of years in Asia and Europe, and were brought to North America by European colonists. Apples have religious and mythological significance in many cultures, including Norse, Greek and European Christian traditions.Apple trees are large if grown from seed. Generally apple cultivars are propagated by grafting onto rootstocks, which control the size of the resulting tree. There are more than 7,500 known cultivars of apples, resulting in a range of desired characteristics. Different cultivars are bred for various tastes and uses, including cooking, eating raw and cider production. Trees and fruit are prone to a number of fungal, bacterial and pest problems, which can be controlled by a number of organic and non-organic means. In 2010, the fruit's genome was sequenced as part of research on disease control and selective breeding in apple production.Worldwide production of apples in 2014 was 84.6 million tonnes, with China accounting for 48% of the total.\",\n    \"imageUrl\": \"https://upload.wikimedia.org/wikipedia/commons/5/55/Apple_orchard_in_Tasmania.jpg\"\n  },\n  {\n    \"scientificName\": \"Beta Vulgaris\",\n    \"commonName\": \"Beet\",\n    \"description\": \"The beetroot is the taproot portion of the beet plant, usually known in North America as the beet and also known as the table beet, garden beet, red beet, or golden beet. It is one of several of the cultivated varieties of Beta vulgaris grown for their edible taproots and their leaves (called beet greens). These varieties have been classified as B. vulgaris subsp. vulgaris Conditiva Group. Other than as a food, beets have use as a food colouring and as a medicinal plant. Many beet products are made from other Beta vulgaris varieties, particularly sugar beet.\",\n    \"imageUrl\": \"https://upload.wikimedia.org/wikipedia/commons/2/29/Beetroot_jm26647.jpg\"\n  },\n  {\n    \"scientificName\": \"Coriandrum Sativum\",\n    \"commonName\": \"Cilantro\",\n    \"description\": \"Coriander, also known as cilantro or Chinese parsley, is an annual herb in the family Apiaceae. All parts of the plant are edible, but the fresh leaves and the dried seeds are the parts most traditionally used in cooking.\",\n    \"imageUrl\": \"https://upload.wikimedia.org/wikipedia/commons/5/51/A_scene_of_Coriander_leaves.JPG\"\n  },\n  {\n    \"scientificName\": \"Solanum Lycopersicum\",\n    \"commonName\": \"Tomato\",\n    \"description\": \"The tomato is the edible, often red, berry of the nightshade Solanum lycopersicum, commonly known as a tomato plant. The species originated in western South America. The Nahuatl (Aztec language) word tomatl gave rise to the Spanish word tomate, from which the English word tomato derived. Its use as a cultivated food may have originated with the indigenous peoples of Mexico. The Spanish encountered the tomato from their contact with the Aztec during the Spanish colonization of the Americas and brought it to Europe. From there, the tomato was introduced to other parts of the European-colonized world during the 16th century.The tomato is consumed in diverse ways, raw or cooked, in many dishes, sauces, salads, and drinks. While tomatoes are fruits – botanically classified as berries – they are commonly used as a vegetable ingredient or side dish.Numerous varieties of the tomato plant are widely grown in temperate climates across the world, with greenhouses allowing for the production of tomatoes throughout all seasons of the year. Tomato plants typically grow to 1–3 meters (3–10 ft) in height. They are vines that have a weak stem that sprawls and typically needs support. Indeterminate tomato plants are perennials in their native habitat, but are cultivated as annuals. Determinate, or bush, plants are annuals that stop growing at a certain height and produce a crop all at once. The size of the tomato varies according to the cultivar, with a range of 0.5–4 inches (1.3–10.2 cm) in width.\",\n    \"imageUrl\": \"https://upload.wikimedia.org/wikipedia/commons/1/17/Cherry_tomatoes_red_and_green_2009_16x9.jpg\"\n  },\n  {\n    \"scientificName\": \"Persea Americana\",\n    \"commonName\": \"Avocado\",\n    \"description\": \"The avocado (Persea americana) is a tree, long thought to have originated in South Central Mexico, classified as a member of the flowering plant family Lauraceae. The fruit of the plant, also called an avocado (or avocado pear or alligator pear), is botanically a large berry containing a single large seed.Avocados are commercially valuable and are cultivated in tropical and Mediterranean climates throughout the world. They have a green-skinned, fleshy body that may be pear-shaped, egg-shaped, or spherical. Commercially, they ripen after harvesting. Avocado trees are partially self-pollinating and are often propagated through grafting to maintain a predictable quality and quantity of the fruit.\",\n    \"imageUrl\": \"https://upload.wikimedia.org/wikipedia/commons/e/e4/Branch_and_fruit_of_the_Maluma_avocado_cultivar.jpg\"\n  },\n  {\n    \"scientificName\": \"Pyrus Communis\",\n    \"commonName\": \"Pear\",\n    \"description\": \"The pear tree and shrub are a species of genus Pyrus, in the family Rosaceae, bearing the pomaceous fruit of the same commonName. Several species of pear are valued for their edible fruit and juices while others are cultivated as trees.\",\n    \"imageUrl\": \"https://upload.wikimedia.org/wikipedia/commons/1/13/More_pears.jpg\"\n  },\n  {\n    \"scientificName\": \"Solanum Melongena\",\n    \"commonName\": \"Eggplant\",\n    \"description\": \"Eggplant (US), aubergine (UK), or brinjal (South Asia and South Africa) is a plant species in the nightshade family Solanaceae, Solanum melongena, grown for its often purple edible fruit.The spongy, absorbent fruit of the plant is widely used in cooking in many different cuisines, and is often considered a vegetable, even though it is a berry by botanical definition. As a member of the genus Solanum, it is related to the tomato and the potato. Like the tomato, its skin and seeds can be eaten, but, like the potato, it is not advisable to eat it raw. Eggplant supplies low contents of macronutrients and micronutrients. The capability of the fruit to absorb oils and flavors into its flesh through cooking is well known in the culinary arts.It was originally domesticated from the wild nightshade species thorn or bitter apple, S. incanum, probably with two independent domestications: one in South Asia, and one in East Asia.\",\n    \"imageUrl\": \"https://upload.wikimedia.org/wikipedia/commons/e/e5/Eggplant_display.JPG\"\n  },\n  {\n    \"scientificName\": \"Vitis Vinifera\",\n    \"commonName\": \"Grape\",\n    \"description\": \"A grape is a fruit, botanically a berry, of the deciduous woody vines of the flowering plant genus Vitis.Grapes can be eaten fresh as table grapes or they can be used for making wine, jam, juice, jelly, grape seed extract, raisins, vinegar, and grape seed oil. Grapes are a non-climacteric type of fruit, generally occurring in clusters.\",\n    \"imageUrl\": \"https://upload.wikimedia.org/wikipedia/commons/0/03/Grape_Plant_and_grapes9.jpg\"\n  },\n  {\n    \"scientificName\": \"Mangifera Indica\",\n    \"commonName\": \"Mango\",\n    \"description\": \"Mangoes are juicy stone fruit (drupe) from numerous species of tropical trees belonging to the flowering plant genus Mangifera, cultivated mostly for their edible fruit.The majority of these species are found in nature as wild mangoes. The genus belongs to the cashew family Anacardiaceae. Mangoes are native to South Asia, from where the 'common mango' or 'Indian mango', Mangifera indica, has been distributed worldwide to become one of the most widely cultivated fruits in the tropics. Other Mangifera species (e.g. horse mango, Mangifera foetida) are grown on a more localized basis.It is the national fruit of India, Pakistan, and the Philippines, and the national tree of Bangladesh.\",\n    \"imageUrl\": \"https://upload.wikimedia.org/wikipedia/commons/6/67/Mangos_criollos_y_pera.JPG\"\n  },\n  {\n    \"scientificName\": \"Citrus Sinensis\",\n    \"commonName\": \"Orange\",\n    \"description\": \"The orange is the fruit of the citrus species Citrus × sinensis in the family Rutaceae. It is also called sweet orange, to distinguish it from the related Citrus × aurantium, referred to as bitter orange. The sweet orange reproduces asexually (apomixis through nucellar embryony); varieties of sweet orange arise through mutations.The orange is a hybrid between pomelo (Citrus maxima) and mandarin (Citrus reticulata). The chloroplast genome, and therefore the maternal line, is that of pomelo. The sweet orange has had its full genome sequenced. Sweet oranges were mentioned in Chinese literature in 314 BC. As of 1987, orange trees were found to be the most cultivated fruit tree in the world. Orange trees are widely grown in tropical and subtropical climates for their sweet fruit. The fruit of the orange tree can be eaten fresh, or processed for its juice or fragrant peel. As of 2012, sweet oranges accounted for approximately 70% of citrus production. In 2014, 70.9 million tonnes of oranges were grown worldwide, with Brazil producing 24% of the world total followed by China and India.\",\n    \"imageUrl\": \"https://upload.wikimedia.org/wikipedia/commons/2/22/Apfelsinenbaum--Orange_tree.jpg\"\n  },\n  {\n    \"scientificName\": \"Helianthus Annuus\",\n    \"commonName\": \"Sunflower\",\n    \"description\": \"Helianthus annuus, the common sunflower, is a large annual forb of the genus Helianthus grown as a crop for its edible oil and edible fruits. This sunflower species is also used as wild bird food, as livestock forage (as a meal or a silage plant), in some industrial applications, and as an ornamental in domestic gardens. The plant was first domesticated in the Americas. Wild Helianthus annuus is a widely branched annual plant with many flower heads. The domestic sunflower, however, often possesses only a single large inflorescence (flower head) atop an unbranched stem. The commonName sunflower may derive from the flower's head's shape, which resembles the sun, or from the impression that the blooming plant appears to slowly turn its flower towards the sun as the latter moves across the sky on a daily basis.Sunflower seeds were brought to Europe from the Americas in the 16th century, where, along with sunflower oil, they became a widespread cooking ingredient.\",\n    \"imageUrl\": \"https://upload.wikimedia.org/wikipedia/commons/a/aa/Sunflowers_in_field_flower.jpg\"\n  },\n  {\n    \"scientificName\": \"Citrullus Lanatus\",\n    \"commonName\": \"Watermelon\",\n    \"description\": \"Citrullus lanatus is a plant species in the family Cucurbitaceae, a vine-like (scrambler and trailer) flowering plant originating in West Africa. It is cultivated for its fruit. The subdivision of this species into two varieties, watermelons (Citrullus lanatus (Thunb.) var. lanatus) and citron melons (Citrullus lanatus var. citroides (L. H. Bailey) Mansf.), originated with the erroneous synonymization of Citrullus lanatus (Thunb.) Matsum. & Nakai and Citrullus vulgaris Schrad. by L.H. Bailey in 1930. Molecular data including sequences from the original collection of Thunberg and other relevant type material, show that the sweet watermelon (Citrullus vulgaris Schrad.) and the bitter wooly melon Citrullus lanatus (Thunb.) Matsum. & Nakai are not closely related to each other. Since 1930, thousands of papers have misapplied the commonName Citrullus lanatus (Thunb.) Matsum. & Nakai for the watermelon, and a proposal to conserve the commonName with this meaning was accepted by the relevant nomenclatural committee and confirmed at the International Botanical Congress in Shenzhen.The bitter South African melon first collected by Thunberg has become naturalized in semiarid regions of several continents, and is designated as a 'pest plant' in parts of Western Australia where they are called pig melon.Watermelon (Citrullus lanatus) is a scrambling and trailing vine in the flowering plant family Cucurbitaceae. The species was long thought to have originated in southern Africa, but this was based on the erroneous synonymization by L. H. Bailey (1930) of a South African species with the cultivated watermelon. The error became apparent with DNA comparison of material of the cultivated watermelon seen and named by Linnaeus and the holotype of the South African species. There is evidence from seeds in Pharao tombs of watermelon cultivation in Ancient Egypt. Watermelon is grown in tropical and subtropical areas worldwide for its large edible fruit, also known as a watermelon, which is a special kind of berry with a hard rind and no internal division, botanically called a pepo. The sweet, juicy flesh is usually deep red to pink, with many black seeds, although seedless varieties have been cultivated. The fruit can be eaten raw or pickled and the rind is edible after cooking.Considerable breeding effort has been put into disease-resistant varieties. Many cultivars are available that produce mature fruit within 100 days of planting the crop.\",\n    \"imageUrl\": \"https://upload.wikimedia.org/wikipedia/commons/f/fc/01266jfWatermelons_Philippines_textures_Apolonio_Samson_Market_Quezon_Cityfvf_02.jpg\"\n  },\n  {\n    \"scientificName\": \"Hibiscus Rosa Sinensis\",\n    \"commonName\": \"Hibiscus\",\n    \"description\": \"Hibiscus is a genus of flowering plants in the mallow family, Malvaceae. The genus is quite large, comprising several hundred species that are native to warm temperate, subtropical and tropical regions throughout the world. Member species are renowned for their large, showy flowers and those species are commonly known simply as 'hibiscus', or less widely known as rose mallow. There are also names for hibiscus such as hardy hibiscus, rose of sharon, and tropical hibiscus.The genus includes both annual and perennial herbaceous plants, as well as woody shrubs and small trees. The generic commonName is derived from the Greek commonName ἰβίσκος (hibiskos) which Pedanius Dioscorides gave to Althaea officinalis (c. 40–90 AD).Several species are widely cultivated as ornamental plants, notably Hibiscus syriacus and Hibiscus rosa-sinensis.A tea made from hibiscus flowers is known by many names around the world and is served both hot and cold. The beverage is known for its red colour, tart flavour, and vitamin C content.\",\n    \"imageUrl\": \"https://upload.wikimedia.org/wikipedia/commons/8/82/Hibiscus_rosa-sinensis_flower_2.JPG\"\n  },\n  {\n    \"scientificName\": \"Cypripedium Reginae\",\n    \"commonName\": \"Pink & White Lady's Slipper\",\n    \"description\": \"Cypripedium reginae, known as the showy lady's slipper, pink-and-white lady's-slipper, or the queen's lady's-slipper, is a rare terrestrial lady's-slipper orchid native to northern North America.It is the state flower of Minnesota, United States, and the provincial flower of Prince Edward Island, Canada.Despite producing a large amount of seeds per seed pod, it reproduces largely by vegetative reproduction, and remains restricted to the North East region of the United States and south east regions of Canada. Although never common, this rare plant has vanished from much of its historical range due to habitat loss. It has been a subject of horticultural interest for many years with Charles Darwin who, like many, was unsuccessful in cultivating the plant.\",\n    \"imageUrl\": \"https://upload.wikimedia.org/wikipedia/commons/a/ab/Cypripedium_reginae_Orchi_004.jpg\"\n  },\n  {\n    \"scientificName\": \"Aquilegia Coerulea\",\n    \"commonName\": \"Rocky Mountain Columbine\",\n    \"description\": \"Aquilegia coerulea, the state flower of Colorado, is a species of flowering plant in the buttercup family Ranunculaceae, native to the Rocky Mountains from Montana south to New Mexico and west to Idaho and Arizona. Its common commonName is Colorado blue columbine; sometimes it is called \\\"Rocky Mountain columbine,\\\" but this also refers to Aquilegia saximontana.\",\n    \"imageUrl\": \"https://upload.wikimedia.org/wikipedia/commons/9/94/Aquilegia_caerulea.jpg\"\n  },\n  {\n    \"scientificName\": \"Magnolia Denudata\",\n    \"commonName\": \"Yulan Magnolia\",\n    \"description\": \"Magnolia denudata, known as the lilytree or Yulan magnolia (simplified Chinese: 玉兰花; traditional Chinese: 玉蘭花), is native to central and eastern China. It has been cultivated in Chinese Buddhist temple gardens since 600 AD. Its flowers were regarded as a symbol of purity in the Tang Dynasty and it was planted in the grounds of the Emperor's palace.It is the official city flower of Shanghai.\",\n    \"imageUrl\": \"https://upload.wikimedia.org/wikipedia/commons/1/13/Yulan_magnolia_%28Magnolia_denudata%29_%2816953983745%29.jpg\"\n  },\n  {\n    \"scientificName\": \"Bougainvillea Glabra\",\n    \"commonName\": \"Bougainvillea\",\n    \"description\": \"Bougainvillea is a genus of thorny ornamental vines, bushes, or trees. The inflorescence consists of large colourful sepallike bracts which surround three simple waxy flowers. The vine species grow anywhere from 1 to 12 m (3 to 40 ft.) tall, scrambling over other plants with their spiky thorns, which are tipped with a black, waxy substance. They are evergreen where rainfall occurs all year, or deciduous if there is a dry season.Bougainvillea glabra (simplified Chinese: 簕杜鹃; traditional Chinese: 簕杜鵑) is the official city flower of Shenzhen and many other cities around the world.\",\n    \"imageUrl\": \"https://upload.wikimedia.org/wikipedia/commons/6/6d/Paperflower_--_Bougainvillea_glabra.jpg\"\n  }\n]"},"parameters":[],"headers":[{"name":"Content-Type","value":"application/json","id":"pair_6533924cbf7648878575eea06a484712"},{"id":"pair_846d0404d5a34ead895e982333334042","name":"Authorization","value":"{{ _.token }}","description":""}],"authentication":{},"metaSortKey":-1638400514939.75,"isPrivate":false,"settingStoreCookies":true,"settingSendCookies":true,"settingDisableRenderRequestBody":false,"settingEncodeUrl":true,"settingRebuildPath":true,"settingFollowRedirects":"global","_type":"request"},{"_id":"req_6d244e60efc04a7ab2f96ec06e94fe09","parentId":"fld_0808fe3a070a49c0b930260685d56178","modified":1639581849970,"created":1639005384967,"url":"{{ _.url }}/plant/findMany","name":"findMany","description":"","method":"GET","body":{"mimeType":"application/json","text":""},"parameters":[],"headers":[{"name":"Content-Type","value":"application/json","id":"pair_6533924cbf7648878575eea06a484712"}],"authentication":{},"metaSortKey":-1638400514933.5,"isPrivate":false,"settingStoreCookies":true,"settingSendCookies":true,"settingDisableRenderRequestBody":false,"settingEncodeUrl":true,"settingRebuildPath":true,"settingFollowRedirects":"global","_type":"request"},{"_id":"req_a2704a4a5ee542e8baa7d98e33dcc6bb","parentId":"fld_0808fe3a070a49c0b930260685d56178","modified":1639581854028,"created":1639005921061,"url":"{{ _.url }}/plant/findUnique","name":"findUnique","description":"","method":"GET","body":{"mimeType":"application/json","text":""},"parameters":[],"headers":[{"name":"Content-Type","value":"application/json","id":"pair_6533924cbf7648878575eea06a484712"}],"authentication":{},"metaSortKey":-1638400514927.25,"isPrivate":false,"settingStoreCookies":true,"settingSendCookies":true,"settingDisableRenderRequestBody":false,"settingEncodeUrl":true,"settingRebuildPath":true,"settingFollowRedirects":"global","_type":"request"},{"_id":"req_54729cde3ad34710bb9994322d15f09a","parentId":"fld_0808fe3a070a49c0b930260685d56178","modified":1639527755348,"created":1639006249417,"url":"{{ _.url }}/plant/update","name":"update","description":"","method":"PATCH","body":{"mimeType":"application/json","text":"{\n  \"nomePopular\": \"Palmeira\"\n}"},"parameters":[],"headers":[{"name":"Content-Type","value":"application/json","id":"pair_6533924cbf7648878575eea06a484712"},{"id":"pair_20fc5a176ceb485c97edbb2719cefe3d","name":"Authorization","value":"{{ _.token }} ","description":""}],"authentication":{},"metaSortKey":-1638400514921,"isPrivate":false,"settingStoreCookies":true,"settingSendCookies":true,"settingDisableRenderRequestBody":false,"settingEncodeUrl":true,"settingRebuildPath":true,"settingFollowRedirects":"global","_type":"request"},{"_id":"req_6d1e2d5051954352b4f7097edcfc9341","parentId":"fld_0808fe3a070a49c0b930260685d56178","modified":1639527762154,"created":1639006741846,"url":"{{ _.url }}/plant/delete","name":"delete","description":"","method":"DELETE","body":{"mimeType":"application/json","text":""},"parameters":[],"headers":[{"name":"Content-Type","value":"application/json","id":"pair_6533924cbf7648878575eea06a484712"},{"id":"pair_c0f2165128614504a0f2d1282c96935c","name":"Authorization","value":"{{ _.token }}","description":""}],"authentication":{},"metaSortKey":-1638400514796,"isPrivate":false,"settingStoreCookies":true,"settingSendCookies":true,"settingDisableRenderRequestBody":false,"settingEncodeUrl":true,"settingRebuildPath":true,"settingFollowRedirects":"global","_type":"request"},{"_id":"req_f9804535cd684c60940c446c510301b7","parentId":"fld_0808fe3a070a49c0b930260685d56178","modified":1639593874634,"created":1639593871602,"url":"{{ _.url }}/plant/deleteMany","name":"deleteMany","description":"","method":"DELETE","body":{"mimeType":"application/json","text":""},"parameters":[],"headers":[{"name":"Content-Type","value":"application/json","id":"pair_6533924cbf7648878575eea06a484712"},{"id":"pair_c0f2165128614504a0f2d1282c96935c","name":"Authorization","value":"{{ _.token }}","description":""}],"authentication":{},"metaSortKey":-1638400514746,"isPrivate":false,"settingStoreCookies":true,"settingSendCookies":true,"settingDisableRenderRequestBody":false,"settingEncodeUrl":true,"settingRebuildPath":true,"settingFollowRedirects":"global","_type":"request"},{"_id":"req_732deba10cef4ff0a9b4f3ca86070a68","parentId":"fld_d359e43229414df68fa2c77c3e176ac3","modified":1639540328861,"created":1639011041939,"url":"{{ _.url }}/auth/login","name":"login","description":"","method":"POST","body":{"mimeType":"application/json","text":"{\n\t\"email\": \"isabellanunes@gmail.com\",\n\t\"password\": \"12345678\"\n}"},"parameters":[],"headers":[{"name":"Content-Type","value":"application/json","id":"pair_e284163e2c8d49e6aa899aa6277301fa"}],"authentication":{},"metaSortKey":-1639011041939,"isPrivate":false,"settingStoreCookies":true,"settingSendCookies":true,"settingDisableRenderRequestBody":false,"settingEncodeUrl":true,"settingRebuildPath":true,"settingFollowRedirects":"global","_type":"request"},{"_id":"fld_d359e43229414df68fa2c77c3e176ac3","parentId":"wrk_c6293ab5a0024a5886bd474ca8829ace","modified":1639011030388,"created":1639011030388,"name":"Auth","description":"","environment":{},"environmentPropertyOrder":null,"metaSortKey":-1639011030388,"_type":"request_group"},{"_id":"req_c006012f7d284a2e862c34ae5e49a510","parentId":"fld_d359e43229414df68fa2c77c3e176ac3","modified":1639527724054,"created":1639177137483,"url":"{{ _.url }}/auth/profile","name":"profile","description":"","method":"GET","body":{"mimeType":"application/json","text":""},"parameters":[],"headers":[{"name":"Content-Type","value":"application/json","id":"pair_e284163e2c8d49e6aa899aa6277301fa"},{"id":"pair_7402944250a14a1cb92b3e47486024d9","name":"Authorization","value":"{{ _.token }}","description":""}],"authentication":{},"metaSortKey":-1638705778467.5,"isPrivate":false,"settingStoreCookies":true,"settingSendCookies":true,"settingDisableRenderRequestBody":false,"settingEncodeUrl":true,"settingRebuildPath":true,"settingFollowRedirects":"global","_type":"request"},{"_id":"env_02d49d6486a721e66381d478c73722f42a9c1df4","parentId":"wrk_c6293ab5a0024a5886bd474ca8829ace","modified":1638399970193,"created":1638399970193,"name":"Base Environment","data":{},"dataPropertyOrder":null,"color":null,"isPrivate":false,"metaSortKey":1638399970193,"_type":"environment"},{"_id":"jar_02d49d6486a721e66381d478c73722f42a9c1df4","parentId":"wrk_c6293ab5a0024a5886bd474ca8829ace","modified":1638399970194,"created":1638399970194,"name":"Default Jar","cookies":[],"_type":"cookie_jar"},{"_id":"spc_dc30e1a5133a424bb5d5067831585231","parentId":"wrk_c6293ab5a0024a5886bd474ca8829ace","modified":1638399970190,"created":1638399970190,"fileName":"Plants API","contents":"","contentType":"yaml","_type":"api_spec"},{"_id":"env_0027e3fec2ec4bc7a07b60afeb86d9de","parentId":"env_02d49d6486a721e66381d478c73722f42a9c1df4","modified":1639531287093,"created":1638400181373,"name":"dev","data":{"url":"http://localhost:3000","token":"Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJlbWFpbCI6ImlzYW51bmVzQGdtYWlsLmNvbSIsImlhdCI6MTYzOTUzMTI3OCwiZXhwIjoxNjM5NTMzMDc4fQ.9scFS89vnCPTUijbvB5WcmketyjnFsejOQnNs6qmht0"},"dataPropertyOrder":{"&":["url","token"]},"color":"#ff0000","isPrivate":false,"metaSortKey":1638400181373,"_type":"environment"},{"_id":"env_905de8d704d9436584302aa3aaca4f1b","parentId":"env_02d49d6486a721e66381d478c73722f42a9c1df4","modified":1639593884206,"created":1638400193872,"name":"prod","data":{"url":"https://plants-api-1.herokuapp.com","token":"Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJlbWFpbCI6ImlzYWJlbGxhbnVuZXNAZ21haWwuY29tIiwiaWF0IjoxNjM5NTkzODA2LCJleHAiOjE2Mzk1OTU2MDZ9.VY4E9fpDqdXGNPgWT-xJtvZuXIuM1Y5WuqSNDW-fljc"},"dataPropertyOrder":{"&":["url","token"]},"color":"#00ff08","isPrivate":false,"metaSortKey":1638400193872,"_type":"environment"}]}