[
  {
    "scientificName": "Hedychium coccineum",
    "commonName": "Gengibre-vermelho",
    "description": "Com belas inflorescências compostas de flores vermelhas, este gengibre se encaixaria muito bem em jardins tropicais, não fosse por um motivo: Como é originária de locais frios, ela se desenvolve muito melhor nestas regiões. Tanto a folhagem como a floração é muito ornamental. É cultivada também como flor-de-corte. Nos invernos rigorosos, perde toda a parte aérea, rebrotando com todo viço na primavera. Pode ser plantada isolada ou em grupos.",
    "imageUrl": "https://www.jardineiro.net/wp-content/uploads/2011/05/hedychium_coccineum.jpg",
  },
  {
    "scientificName": "Buxus sempervirens",
    "commonName": "Buxinho",
    "description": "O buxinho é uma planta arbusto e lenhosa, muito utilizada para a topiaria, por suas inúmeras qualidades. Sua folhagem verde escura é resistente e regenera-se bem das podas semestrais. Se você quer um autêntico jardim francês não pode dispensar o buxinho em cercas vivas, bordaduras e topiarias, porém deve ter paciência, pois seu crescimento é relativamente lento se comparado às outros arbustos. Com o tempo e boas podas de formação, torna-se bastante compacto e denso.",
    "imageUrl": "https://www.jardineiro.net/wp-content/uploads/2011/05/buxus_sempervirens.jpg",
  },
  {
    "scientificName": "Dyckia brevifolia",
    "commonName": "Bromélia-lâmina-de-serra",
    "description": "A bromélia-lâmina-de-serra é uma planta perene, originária do estado de Santa Catarina, no Brasil, que se destaca por sua folhagem ornamental. É uma planta reófita, ou seja, fica confinada no leito de córregos e rios de fluxo rápido, onde suas raízes se prendem firmemente às fissuras entre as rochas, ficando sujeitas a inundações frequentes. Ela cresce em rosetas adensadas de até 20cm de altura, com folhagem suculenta a coriácea e recoberta por escamas. As folhas possuem espinhos nas margens, são recurvadas e tem a cor verde, podendo assumir um tom acinzentado conforme a variedade. Existe ainda cultivares com o centro mais ou menos amarelo, como a ‘Moon Glow’, a ‘Yellow Glow’ e a ‘Golden Glow’ e variedades com tonalidades diferentes de verde e outras variações, como a D. brevifolia subidenses, ‘Ilha da Cotia’ e ‘Izabel’. A inflorescência surge na primavera, com hastes laterais bem finas e eretas, de até 80cm de altura. Elas são racemosas, têm pouca importância ornamental e podem apresentar flores em formato de sino, de cor laranja ou amarela, tornando-se um atrativo para abelhas e beija-flores. Após a floração, a planta entra em lento declínio, e emite novas mudas a partir da base.",
    "imageUrl": "https://www.jardineiro.net/wp-content/uploads/2021/11/Dyckia_brevifolia_3-1.jpg",
  },
  {
    "scientificName": "Philodendron gloriosum",
    "commonName": "Filodendro-glorioso",
    "description": "O filodendro-glorioso é uma espécie herbácea, rizomatosa e perene, que se destaca pela folhagem exuberante. Nativo da América Central e do Sul, ele cresce na sombra das árvores, em regiões de vale de florestas tropicais. Ao contrário de outros filodendros, o P. gloriosum não tem por hábito subir no tronco das árvores, preferindo se desenvolver como rasteira, crescendo seu rizoma horizontalmente na serrapilheira da floresta.",
    "imageUrl": "https://www.jardineiro.net/wp-content/uploads/2021/11/philodendron_gloriosum.jpg",
  },
  {
    "scientificName": "Anthurium veitchii",
    "commonName": "Antúrio-rei",
    "description": "O antúrio-rei é uma espécie herbácea, epífita, perene, originária das florestas tropicais da Colômbia e que se destaca por sua folhagem exuberante. Apresenta longos pecíolos eretos, com folhas pendentes, estreitas, coriáceas, com formato cordiforme alongado e cor verde-escura brilhante. Além disso, elas tem uma ondulação, um aspecto corrugado característico, que lhe confere uma textura única. Quando jovens as folhas ainda tem a cor bronzeada a enferrujada. Não confunda o antúrio-rei, com o antúrio-rainha, da espécie Anthurium warocqueanum.",
    "imageUrl": "https://www.jardineiro.net/wp-content/uploads/2021/12/Anthurium_veitchii_01.jpg",
  },
  {
    "scientificName": "Philodendron elegans",
    "commonName": "Filodendro-elegante",
    "description": "O filodendro-elegante é uma espécie herbácea, epífita, rizomatosa e perene, que se destaca por sua folhagem deslumbrante em forma de esqueleto. Nativa da Floresta Amazônica, além de epífita ela é também trepadeira, assim como a maioria dos filodendros. Apresenta rizoma forte e ascendente, com raízes aéreas que auxiliam sua fixação sobre o tronco das árvores. Suas folhas surgem do rizoma, protegidas por catáfilos e são sustentadas por longos pecíolos teretes (cilíndricos), podendo atingir até 60cm de diâmetro. Elas são subcoriáceas, recortadas, divididas em longos e finos lóbulos, brilhantes, acuminados e semelhantes às frondes de uma palmeira. As folhas se apresentam em dois tons de verde, um mais escuro nas extremidades e outro mais claro no centro, com as nervuras principais em baixo relevo. É importante ressaltar que as primeiras folhas da planta se diferem da forma adulta. Elas são menores, de aspecto menos recortado, com recortes menos profundos e lóbulos arredondados. Assim, à medida em que a planta amadurece e ascende sobre o suporte, suas folhas vão chegando no formato de esqueleto característico.",
    "imageUrl": "https://www.jardineiro.net/wp-content/uploads/2021/12/Philodendron.elegans.jpg",
  },
  {
    "scientificName": "Dionaea muscipula",
    "commonName": "Dionéia",
    "description": "A dionéia é uma planta herbácea carnívora nativa dos pântanos do sudeste dos Estados Unidos, nos estados da Carolina do Norte e do Sul. Ela é uma das pouquíssimas espécies de plantas capazes de realizar movimentos, juntamente com a drosera e a dormideira. É uma planta bem pequena, com no máximo 10 cm de altura e cerca de 4 a 8 folhas dispostas em roseta. Suas folhas são muito particulares, compostas de pecíolo e uma armadilha, divida em dois lóbulos, como uma mandíbula com 15 a 20 longos “dentes” nas bordas. O pecíolo é achatado, verde e além de sustentar a mandíbula tem função fotossíntética.",
    "imageUrl": "https://www.jardineiro.net/wp-content/uploads/2011/05/dionaea_muscipula.jpg",
  },
  {
    "scientificName": "Nepenthes spp",
    "commonName": "Planta-jarro",
    "description": "Planta-jarro é o nome popular dado às plantas pertencentes ao gênero Nepenthes. Elas são plantas carnívoras, em sua grande maioria trepadeiras ou epífitas, cultivadas em todo o mundo por aficionados e colecionadores e que, ultimamente tem se popularizado ganhando os jardins comuns. Elas perfazem cerca de 100 espécies e são originárias de diferentes regiões tropicais do velho mundo, notadamente da Ásia e Oceânia. Atualmente, no entanto, há centenas de híbridos e variedades, com grandes variações nas cores, formas e tamanhos, para satisfazer todos os gostos. Podemos dividir as plantas-jarro em dois principais grupos, as de terras altas, que crescem em regiões montanhosas e preferem noites frescas, e as de terras baixas, que apreciam muito o calor e a umidade. Os híbridos mais comuns são oriundos de espécies de terras baixas, por serem mais fáceis de cultivar. Entre os híbridos e variedades mais comuns e boas para os iniciantes estão: híbridos de N. alata, N. ampullaria, N. khasiana, N. ventricosa, N. alba, N. gracilis, como N. x mixta, N. x ventrata, N. x superba, N.x wrigleyana, por exemplo.",
    "imageUrl": "https://www.jardineiro.net/wp-content/uploads/2014/09/planta-jarro_nepenthes.jpg",
  },
  {
    "scientificName": "Acalypha wilkesiana",
    "commonName": "Crista-de-peru",
    "description": "A crista-de-peru é um arbusto de folhagem muito ornamental, a crista-de-peru é bastante rústica e muito utilizada em jardins públicos e residenciais que exigem pouca manutenção. Seu aspecto é bem denso e tropical, as folhas são brilhantes, macias e com bordas serrilhadas. Há diversas variedades disponíveis, com diferentes cores e formas, que podem ser marrons, vermelhas, verdes, manchadas ou com bordas descoloridas, lisas ou retorcidas. As inflorescências são discretas e alongadas e têm pouca importância ornamental.",
    "imageUrl": "https://www.jardineiro.net/wp-content/uploads/2011/05/acalypha_wilkesiana.jpg",
  },
  {
    "scientificName": "Acnistus arborescens",
    "commonName": "Fruta-do-sabiá",
    "description": "A fruta-do-sabiá é uma árvore de pequeno porte de floração e frutificação ornamentais, com um importante papel ecológico. Seus frutos servem de alimento para uma grande variedade de aves silvestres, entre estes o sabiá (Turdus rufiventris). Atinge porte arbustivo ou de arvoreta, dificilmente ultrapassando 10 metros de altura. Apresenta ramos finos, ramificados e de madeira leve e frágil. As folhas são simples, alternas, elípticas a lanceoladas, com a página superior glabra e a inferior ligeiramente tomentosa. As flores podem surgir o ano todo, mas com mais intensidade na primavera e verão. Com formato tubular e campanulada, perfumadas e brancas, elas se reúnem em inflorescências do tipo fascículo, ao longo dos ramos maduros, nos espaços  onde não há folhas.",
    "imageUrl": "https://www.jardineiro.net/wp-content/uploads/2020/01/fruta_do_sabia.jpg",
  },
  {
    "scientificName": "Bambusa ventricosa",
    "commonName": "Bambu-barriga-de-buda",
    "description": "O bambu-barriga-de-buda é uma planta rizomatosa, entouceirada e de hastes e folhagem ornamental. Seu uso ainda é restrito, mas vem se popularizando nos últimos anos como planta de dupla função: escultural e cerca-viva. Apresenta colmos com entrenós curtos e engrossados, o que lhe confere o aspecto tão característico e curioso. Inicialmente os colmos são verde escuros, mas com a maturidade adquirem tons amarelos a castanhos. As folhas são alongadas e de cor verde. Elas caem a cada novo crescimento. Assim como outros bambus, esta espécie raramente floresce.",
    "imageUrl": "https://www.jardineiro.net/wp-content/uploads/2015/03/bambu_barriga_buda_bambusa_ventricosa.jpg",
  },
  {
    "scientificName": "Baccharis trimera",
    "commonName": "Carqueja",
    "description": "A carqueja é uma erva espontânea em terrenos baldios e pastos, sendo por muitas vezes considerada daninha. Ela não possui folhas verdadeiras e suas hastes são ramificadas e apresentam asas membranáceas, descontínuas e verdes, responsáveis pela fotossíntese da planta. As flores são branco-amareladas e surgem em pequenos tufos na primavera e verão. Não deve ser confundida com a carqueja de Portugal, a Pterospartum tridentatum, de utilizações medicinais também, além de culinárias.",
    "imageUrl": "https://www.jardineiro.net/wp-content/uploads/2011/05/baccharis_trimera.jpg",
  },
  {
    "scientificName": "Caladium bicolor",
    "commonName": "Caládio",
    "description": "Os caládios são plantas bulbosas muito apreciadas devido à sua folhagem ornamental. Elas apresentam folhas grandes, rajadas ou pintalgadas, com duas ou mais cores e tonalidades de branco, verde, rosa ou vermelho. As inflorescências têm importância ornamental secundária e são muito parecidas com as do lírio-da-paz (Spathiphyllum wallisi), sendo brancas ou esverdeadas e podem ser pintalgadas como as folhas. A floração ocorre no verão.",
    "imageUrl": "https://www.jardineiro.net/wp-content/uploads/2011/05/caladium_bicolor.jpg",
  },
  {
    "scientificName": "Dombeya wallichii",
    "commonName": "Astrapéia",
    "description": "A astrapéia é uma arvoreta ou arbusto de ótimas características ornamentais, que se espalhou pelo mundo por sua exuberância e popularidade. Ela apresenta ramos pubescentes, e porte pequeno para um árvore, alcançando cerca de 2 a 5 metros de altura. As folhas são grandes, cordiformes, perenes, de cor verde brilhante e pubescentes na página inferior. As inflorescências surgem no outono e inverno, e são umbeliformes, sustentadas por longos pedúnculos, pendentes, globosas e com numerosas flores de cor rosa a avermelhada, ricas em néctar e delicadamente perfumadas. Produz frutos do tipo cápsula, que se dividem em cinco partes.",
    "imageUrl": "https://www.jardineiro.net/wp-content/uploads/2011/05/dombeya_wallichii.jpg",
  },
  {
    "scientificName": "Bambusa textilis gracilis",
    "commonName": "Bambuzinho-de-jardim",
    "description": "De cor e textura espetacular, o bambuzinho só acrescenta vida aos nossos jardins. De folhagem fina e coloração amarelo-limão, vai muito bem em renques e muros, não podendo faltar no jardim japonês, para quebrar a austeridade. Multiplica-se pela divisão da touceira.",
    "imageUrl": "https://www.jardineiro.net/wp-content/uploads/2011/05/bambusa_gracilis.jpg",
  },
  {
    "scientificName": "Echinocactus grusonii",
    "commonName": "Cadeira-de-sogra",
    "description": "Grande e redonda, a cadeira-de-sogra é originária do México e chega a medir 60 cm de diâmetro. Nesta planta, assim como em muitas cactáceas não há folhas e o tronco é responsável pela fotossíntese. Os espinhos são longos e amarelados e seguem uma orientação radial, demarcando os sulcos profundos do caule da planta. Produz flores isoladas e grande de cor amarela.",
    "imageUrl": "https://www.jardineiro.net/wp-content/uploads/2011/05/800px-Echinocact_Gruson_Prag.jpg",
  },
  {
    "scientificName": "Fittonia albivenis",
    "commonName": "Planta-mosaico",
    "description": "A planta-mosaico é uma espécie rasteira e herbácea, de folhagem decorativa e muito popular em terrários fechados, locais em que se adapta muito bem, por sua grande necessidade de umidade. Apresenta ramagem macia e pubescente, com folhas simples, ovaladas, opostas, de nervuras bem marcadas e contrastantes na cor branca, na espécie típica. Floresce ao final do verão, despontando espigas eretas, acima da folhagem, com flores pequenas que vão desabrochando aos poucos da base em direção ao topo e são protegidas por brácteas verdes.",
    "imageUrl": "https://www.jardineiro.net/wp-content/uploads/2015/09/fittonia.jpg",
  },
  {
    "scientificName": "Goeppertia insignis",
    "commonName": "Maranta-cascavel",
    "description": "A maranta-cascavel é uma espécie herbácea, perene, com folhagem ornamental bem característica, de forma que os tons de verde nas folhas parecem terem sido pintados à mão. É uma espécie nativa da Mata Atlântica no Rio de Janeiro, por isso aprecia um clima quente e úmido. Cresce em touceiras, com folhas compridas, levemente onduladas nas margens, coriáceas e eretas, em forma de espada, recordando o formato dos guizos da cobra cascavel.",
    "imageUrl": "https://www.jardineiro.net/wp-content/uploads/2021/10/Calathea_lancifolia.jpg",
  },
  {
    "scientificName": "Gomphrena globosa",
    "commonName": "Perpétua",
    "description": "A perpétua é originalmente uma planta herbácea de flores de coloração roxa. No entanto, hoje em dia já são produzidas variedades de diversas cores. Suas folhas são oval-lanceoladas, de textura pilosa e coloração verde-clara. Ela é versátil, tendo várias funções paisagísticas, podendo ser utilizada como forração ou para compor canteiros, bordaduras e maciços. Além disso, pode ser cultivada para a produção de flores secas.",
    "imageUrl": "https://www.jardineiro.net/wp-content/uploads/2011/05/gomphrena_globosa.jpg",
  },
  {
    "scientificName": "Heliconia velloziana",
    "commonName": "Caeté",
    "description": "A Heliconia velloziana é muito utilizada como flor de corte, conferindo aspecto tropical a qualquer arranjo. Da mesma forma no jardim, suas qualidades paisagísticas a tornam uma planta que caracteriza o jardim tropical. As folhas são lisas, largas, grandes com pecíolo longo. As inflorescências formadas no verão, são eretas, com brácteas maiores na base e menores no ápice. As brácteas podem ser de coloração vermelho vivo ou laranja, com flores amarelas. Presta-se para formação de renques junto a muros, maciços, composições com outras plantas ou como planta isolada.",
    "imageUrl": "https://www.jardineiro.net/wp-content/uploads/2011/05/heliconia_velloziana-199x300.jpg",
  }
]